opendj-sdk/opends/tests/functional-tests/shared/data/dsml/suites/03dsmlerrsuite/data/abandon_mismatched.dat

POST /dsml HTTP/1.1
Host: Foo
Connection: Close
Content-Length: 596
SOAPAction: batchRequest

<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
  <soap-env:Body>
<batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core"
   requestID="[controlValue] start element child of [control] element is missing"
   >
<abandonRequest abandonID="12">
<control type="2.16.840.1.113730.3.3.2.20.1">
control value for test</controlValue>
</control>
</abandonRequest>
</batchRequest>
</soap-env:Body>
</soap-env:Envelope>
